{"modelTopology": {"backend": "tensorflow", "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"epsilon": 1e-07, "beta_2": 0.9990000128746033, "decay": 0.0, "amsgrad": false, "lr": 0.00010000000474974513, "beta_1": 0.8999999761581421}}, "metrics": ["accuracy"], "loss": "categorical_crossentropy", "loss_weights": null, "sample_weight_mode": null}, "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "filters": 48, "trainable": true, "kernel_size": [11, 11], "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_regularizer": null, "name": "conv2d", "bias_regularizer": null, "strides": [3, 3], "batch_input_shape": [null, 400, 400, 1], "data_format": "channels_last", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "name": "max_pooling2d", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "dtype": "float32", "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization", "axis": [3], "trainable": true, "center": true, "scale": true, "dtype": "float32", "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "filters": 128, "trainable": true, "kernel_size": [5, 5], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_regularizer": null, "name": "conv2d_1", "bias_regularizer": null, "strides": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "dtype": "float32", "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "axis": [3], "trainable": true, "center": true, "scale": true, "dtype": "float32", "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "filters": 192, "trainable": true, "kernel_size": [3, 3], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_regularizer": null, "name": "conv2d_2", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "filters": 192, "trainable": true, "kernel_size": [3, 3], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_regularizer": null, "name": "conv2d_3", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_constraint": null, "filters": 128, "trainable": true, "kernel_size": [3, 3], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_regularizer": null, "name": "conv2d_4", "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "dtype": "float32", "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_2", "axis": [3], "trainable": true, "center": true, "scale": true, "dtype": "float32", "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "flatten"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "name": "dense", "trainable": true, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "units": 2048}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout", "trainable": true, "seed": null, "noise_shape": null, "dtype": "float32"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "trainable": true, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "units": 2048}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "dtype": "float32"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "name": "dense_2", "trainable": true, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "sigmoid", "units": 5}}]}, "keras_version": "2.1.6-tf"}, "weightsManifest": [{"weights": [{"dtype": "float32", "shape": [48], "name": "batch_normalization/gamma"}, {"dtype": "float32", "shape": [48], "name": "batch_normalization/beta"}, {"dtype": "float32", "shape": [48], "name": "batch_normalization/moving_mean"}, {"dtype": "float32", "shape": [48], "name": "batch_normalization/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_1/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_2/moving_variance"}, {"dtype": "float32", "shape": [11, 11, 1, 48], "name": "conv2d/kernel"}, {"dtype": "float32", "shape": [48], "name": "conv2d/bias"}, {"dtype": "float32", "shape": [5, 5, 48, 128], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_1/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 192], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [192], "name": "conv2d_2/bias"}, {"dtype": "float32", "shape": [3, 3, 192, 192], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [192], "name": "conv2d_3/bias"}, {"dtype": "float32", "shape": [3, 3, 192, 128], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_4/bias"}, {"dtype": "float32", "shape": [2048, 2048], "name": "dense/kernel"}, {"dtype": "float32", "shape": [2048], "name": "dense/bias"}, {"dtype": "float32", "shape": [2048, 2048], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [2048], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [2048, 5], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [5], "name": "dense_2/bias"}], "paths": ["group1-shard1of9", "group1-shard2of9", "group1-shard3of9", "group1-shard4of9", "group1-shard5of9", "group1-shard6of9", "group1-shard7of9", "group1-shard8of9", "group1-shard9of9"]}]}